eddy103-hub/bldc_hall_oledC/dsPIC33CK_BLDC_Motor/dsPIC33CK_BLDC_Motor.X/mcc_generated_files/adc1.h
inline static void ADC1_SoftwareTriggerEnable(void)
{
   ADCON3Lbits.SWCTRG = 1;
}

/**
  @Summary
    Disables software common trigger.

  @Description
    This routine is used to disable the ADC1 software common trigger.
 
  @Preconditions
    ADC1_Initialize function should have been called 
    before calling this function.

  @Param
    None.

  @Returns
    None.

  @Example
    <code>
        int conversion,i=0;
        ADC1_Initialize();

        ADC1_Enable();
        ADC1_ChannelSelect(channel);
        ADC1_SoftwareTriggerEnable();
        //Provide Delay
        for(i=0;i <1000;i++)
        {
        }
        ADC1_SoftwareTriggerDisable();
        while(!ADC1_IsConversionComplete(channel));
        conversion = ADC1_ConversionResultGet(channel);
        ADC1_Disable(); 
    </code>
*/
inline static void ADC1_SoftwareTriggerDisable(void)
{
   ADCON3Lbits.SWCTRG = 0;
}

/**
  @Summary
    Allows selection of a channel for conversion.

  @Description
    This routine is used to select desired channel for conversion.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.

  @Param
    channel - Channel for conversion

  @Returns
    None
  
  @Example
    <code>
        int conversion,i=0;
        ADC1_Initialize();

        ADC1_Enable();
        ADC1_ChannelSelect(channel);
        ADC1_SoftwareTriggerEnable();
        //Provide Delay
        for(i=0;i <1000;i++)
        {
        }
        ADC1_SoftwareTriggerDisable();
        while(!ADC1_IsConversionComplete(channel));
        conversion = ADC1_ConversionResultGet(channel);
        ADC1_Disable(); 
    </code>
*/
inline static void ADC1_ChannelSelect( ADC1_CHANNEL channel )
{
    /*This routine does not have any implementation since 
            *Shared channels are selected from UI.
            *Dedicated channels are selected from UI.
    */
}

/**
  @Summary
    Returns the conversion value for the channel selected.

  @Description
    This routine is used to get the analog to digital converted value for a 
    specific channel.
 
  @Preconditions
    This routine returns the conversion value only after the conversion is complete. 
    Conversion completion status can be checked using ADC1_IsConversionComplete(channel)
    routine.

  @Param
    channel - Selected channel
   
  @Returns
   Returns the analog to digital converted value
  
  @Example
    <code>
        int conversion,i=0;
        ADC1_Initialize();

        ADC1_Enable();
        ADC1_ChannelSelect(channel);
        ADC1_SoftwareTriggerEnable();
        //Provide Delay
        for(i=0;i <1000;i++)
        {
        }
        ADC1_SoftwareTriggerDisable();
        while(!ADC1_IsConversionComplete(channel));
        conversion = ADC1_ConversionResultGet(channel);
        ADC1_Disable(); 
    </code>
 */
inline static uint16_t ADC1_ConversionResultGet( ADC1_CHANNEL channel )
{
    uint16_t result;

    switch(channel)
    {
        case I_B:
                result = ADCBUF3;
                break;
        case I_C:
                result = ADCBUF6;
                break;
        case I_A:
                result = ADCBUF10;
                break;
        case V_B:
                result = ADCBUF15;
                break;
        case V_A:
                result = ADCBUF17;
                break;
        case V_C:
                result = ADCBUF22;
                break;
        case POT_Speed:
                result = ADCBUF23;
                break;
        case channel_AN24:
                result = ADCBUF24;
                break;
        case channel_AN25:
                result = ADCBUF25;
                break;
        default:
                break;
    }
    return result;
}

/**
  @Summary
    Returns the status of conversion.

  @Description
    This routine is used to determine if conversion is completed. When conversion
    is complete the routine returns true otherwise false.
 
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.

  @Param
    channel - Selected channel
 
  @Returns
    true - Conversion is complete.
    false - Conversion is not complete.
  
  @Example
    <code>
        int conversion,i=0;
        ADC1_Initialize();

        ADC1_Enable();
        ADC1_ChannelSelect(channel);
        ADC1_SoftwareTriggerEnable();
        //Provide Delay
        for(i=0;i <1000;i++)
        {
        }
        ADC1_SoftwareTriggerDisable();
        while(!ADC1_IsConversionComplete(channel));
        conversion = ADC1_ConversionResultGet(channel);
        ADC1_Disable(); 
    </code>
 */
inline static bool ADC1_IsConversionComplete(ADC1_CHANNEL channel)
{
    bool status;

    switch(channel)
    {
        case I_B:
                status = ADSTATLbits.AN3RDY;
                break;
        case I_C:
                status = ADSTATLbits.AN6RDY;
                break;
        case I_A:
                status = ADSTATLbits.AN10RDY;
                break;
        case V_B:
                status = ADSTATLbits.AN15RDY;
                break;
        case V_A:
                status = ADSTATHbits.AN17RDY;
                break;
        case V_C:
                status = ADSTATHbits.AN22RDY;
                break;
        case POT_Speed:
                status = ADSTATHbits.AN23RDY;
                break;
        case channel_AN24:
                status = ADSTATHbits.AN24RDY;
                break;
        case channel_AN25:
                status = ADSTATHbits.AN25RDY;
                break;
        default:
                break;
    }

    return status;
}

/**
  @Summary
    Enables interrupts.

  @Description
    This routine is used to enable the ADC1 interrupt.
 
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None.

  @Example
    <code>
        ADC1_InterruptEnable(); 
    </code>
*/
inline static void ADC1_InterruptEnable(void)
{
    IEC5bits.ADCIE = 1;
}

/**
  @Summary
    Disables interrupts.

  @Description
    This routine is used to disable the ADC1 interrupt.
 
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None.

  @Example
    <code>
        ADC1_InterruptDisable(); 
    </code>
*/
inline static void ADC1_InterruptDisable(void)
{
    IEC5bits.ADCIE = 0;
}

/**
  @Summary
    Clears interrupt flag

  @Description
    This routine is used to clear the interrupt flag manually.
 
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None.

  @Example
    <code>
        ADC1_InterruptFlagClear(); 
    </code>
*/
inline static void ADC1_InterruptFlagClear(void)
{
    IFS5bits.ADCIF = 0;
}

/**
  @Summary
    Allows selection of priority for interrupt.

  @Description
    This routine is used to select desired priority for interrupt.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None.

  @Example
    <code>
        uint16_t priorityValue;
        priorityValue = 0x002;
 
        ADC1_InterruptPrioritySet(priorityValue); 
    </code>
*/
inline static void ADC1_InterruptPrioritySet( uint16_t priorityValue )
{
    IPC22bits.ADCIP = 0x7 & priorityValue;
}

/**
  @Summary
    ADC1 Common callback routine.

  @Description
    This routine is a ADC1 Common callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetCommonInterruptHandler(&ADC1_CallBack);
    </code>
*/
void ADC1_CallBack(void);

/**
  @Summary
    Assigns a function pointer with a ADC1 Common callback address.

  @Description
    This routine assigns a function pointer with a ADC1 Common callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetCommonInterruptHandler(&ADC1_CallBack);
    </code>
*/
void ADC1_SetCommonInterruptHandler(void* handler);


/**
  @Summary
    Enables individual channel interrupt.

  @Description
    This routine is used to enable the ADC1 individual channel
    interrupt.
 
  @Preconditions
    None.

  @Param
    channel - Selected channel

  @Returns
    None.

  @Example
    <code>
        ADC1_IndividualChannelInterruptEnable(channel); 
    </code>
*/
inline static void ADC1_IndividualChannelInterruptEnable(ADC1_CHANNEL channel)
{
    switch(channel)
    {
        case I_B:
                IEC5bits.ADCAN3IE = 1;
                break;
        case I_C:
                IEC6bits.ADCAN6IE = 1;
                break;
        case I_A:
                IEC6bits.ADCAN10IE = 1;
                break;
        case V_B:
                IEC6bits.ADCAN15IE = 1;
                break;
        case V_A:
                IEC6bits.ADCAN17IE = 1;
                break;
        case V_C:
                IEC7bits.ADCAN22IE = 1;
                break;
        case POT_Speed:
                IEC7bits.ADCAN23IE = 1;
                break;
        case channel_AN24:
                IEC12bits.ADCAN24IE = 1;
                break;
        case channel_AN25:
                IEC12bits.ADCAN25IE = 1;
                break;
        default:
                break;
    }
}

/**
  @Summary
    Disables individual channel interrupt.

  @Description
    This routine is used to disable the ADC1 individual channel
    interrupt.
 
  @Preconditions
    None.

  @Param
    channel - Selected channel

  @Returns
    None.

  @Example
    <code>
        ADC1_IndividualChannelInterruptDisable(channel); 
    </code>
*/
inline static void ADC1_IndividualChannelInterruptDisable(ADC1_CHANNEL channel)
{
    switch(channel)
    {
        case I_B:
                IEC5bits.ADCAN3IE = 0;
                break;
        case I_C:
                IEC6bits.ADCAN6IE = 0;
                break;
        case I_A:
                IEC6bits.ADCAN10IE = 0;
                break;
        case V_B:
                IEC6bits.ADCAN15IE = 0;
                break;
        case V_A:
                IEC6bits.ADCAN17IE = 0;
                break;
        case V_C:
                IEC7bits.ADCAN22IE = 0;
                break;
        case POT_Speed:
                IEC7bits.ADCAN23IE = 0;
                break;
        case channel_AN24:
                IEC12bits.ADCAN24IE = 0;
                break;
        case channel_AN25:
                IEC12bits.ADCAN25IE = 0;
                break;
        default:
                break;
    }
}

/**
  @Summary
    Clears individual channel interrupt flag

  @Description
    This routine is used to clear the individual channel interrupt flag manually.
 
  @Preconditions
    None.

  @Param
    channel - Selected channel

  @Returns
    None.

  @Example
    <code>
        ADC1_IndividualChannelInterruptFlagClear(channel); 
    </code>
*/
inline static void ADC1_IndividualChannelInterruptFlagClear(ADC1_CHANNEL channel)
{
    switch(channel)
    {
        case I_B:
                IFS5bits.ADCAN3IF = 0;
                break;
        case I_C:
                IFS6bits.ADCAN6IF = 0;
                break;
        case I_A:
                IFS6bits.ADCAN10IF = 0;
                break;
        case V_B:
                IFS6bits.ADCAN15IF = 0;
                break;
        case V_A:
                IFS6bits.ADCAN17IF = 0;
                break;
        case V_C:
                IFS7bits.ADCAN22IF = 0;
                break;
        case POT_Speed:
                IFS7bits.ADCAN23IF = 0;
                break;
        case channel_AN24:
                IFS12bits.ADCAN24IF = 0;
                break;
        case channel_AN25:
                IFS12bits.ADCAN25IF = 0;
                break;
        default:
                break;
    }
}

/**
  @Summary
    ADC1 I_B callback routine.

  @Description
    This routine is a ADC1 I_B callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetI_BInterruptHandler(&ADC1_I_B_CallBack);
    </code>
*/
void ADC1_I_B_CallBack(uint16_t adcVal);

/**
  @Summary
    Assigns a function pointer with a ADC1 I_B callback address.

  @Description
    This routine assigns a function pointer with a ADC1 I_B callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetI_BInterruptHandler(&ADC1_I_B_CallBack);
    </code>
*/
void ADC1_SetI_BInterruptHandler(void* handler);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for ADC1 I_B polled implementations.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Param
    None

  @Returns 
    None
 
  @Example
    <code>    
        ADC1_I_B_Tasks();
    </code>
*/
void ADC1_I_B_Tasks(void);

/**
  @Summary
    ADC1 I_C callback routine.

  @Description
    This routine is a ADC1 I_C callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetI_CInterruptHandler(&ADC1_I_C_CallBack);
    </code>
*/
void ADC1_I_C_CallBack(uint16_t adcVal);

/**
  @Summary
    Assigns a function pointer with a ADC1 I_C callback address.

  @Description
    This routine assigns a function pointer with a ADC1 I_C callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetI_CInterruptHandler(&ADC1_I_C_CallBack);
    </code>
*/
void ADC1_SetI_CInterruptHandler(void* handler);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for ADC1 I_C polled implementations.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Param
    None

  @Returns 
    None
 
  @Example
    <code>    
        ADC1_I_C_Tasks();
    </code>
*/
void ADC1_I_C_Tasks(void);

/**
  @Summary
    ADC1 I_A callback routine.

  @Description
    This routine is a ADC1 I_A callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetI_AInterruptHandler(&ADC1_I_A_CallBack);
    </code>
*/
void ADC1_I_A_CallBack(uint16_t adcVal);

/**
  @Summary
    Assigns a function pointer with a ADC1 I_A callback address.

  @Description
    This routine assigns a function pointer with a ADC1 I_A callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetI_AInterruptHandler(&ADC1_I_A_CallBack);
    </code>
*/
void ADC1_SetI_AInterruptHandler(void* handler);

/**
  @Summary
    ADC1 V_B callback routine.

  @Description
    This routine is a ADC1 V_B callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetV_BInterruptHandler(&ADC1_V_B_CallBack);
    </code>
*/
void ADC1_V_B_CallBack(uint16_t adcVal);

/**
  @Summary
    Assigns a function pointer with a ADC1 V_B callback address.

  @Description
    This routine assigns a function pointer with a ADC1 V_B callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetV_BInterruptHandler(&ADC1_V_B_CallBack);
    </code>
*/
void ADC1_SetV_BInterruptHandler(void* handler);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for ADC1 V_B polled implementations.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Param
    None

  @Returns 
    None
 
  @Example
    <code>    
        ADC1_V_B_Tasks();
    </code>
*/
void ADC1_V_B_Tasks(void);

/**
  @Summary
    ADC1 V_A callback routine.

  @Description
    This routine is a ADC1 V_A callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetV_AInterruptHandler(&ADC1_V_A_CallBack);
    </code>
*/
void ADC1_V_A_CallBack(uint16_t adcVal);

/**
  @Summary
    Assigns a function pointer with a ADC1 V_A callback address.

  @Description
    This routine assigns a function pointer with a ADC1 V_A callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetV_AInterruptHandler(&ADC1_V_A_CallBack);
    </code>
*/
void ADC1_SetV_AInterruptHandler(void* handler);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for ADC1 V_A polled implementations.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Param
    None

  @Returns 
    None
 
  @Example
    <code>    
        ADC1_V_A_Tasks();
    </code>
*/
void ADC1_V_A_Tasks(void);

/**
  @Summary
    ADC1 V_C callback routine.

  @Description
    This routine is a ADC1 V_C callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetV_CInterruptHandler(&ADC1_V_C_CallBack);
    </code>
*/
void ADC1_V_C_CallBack(uint16_t adcVal);

/**
  @Summary
    Assigns a function pointer with a ADC1 V_C callback address.

  @Description
    This routine assigns a function pointer with a ADC1 V_C callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetV_CInterruptHandler(&ADC1_V_C_CallBack);
    </code>
*/
void ADC1_SetV_CInterruptHandler(void* handler);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for ADC1 V_C polled implementations.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Param
    None

  @Returns 
    None
 
  @Example
    <code>    
        ADC1_V_C_Tasks();
    </code>
*/
void ADC1_V_C_Tasks(void);

/**
  @Summary
    ADC1 POT_Speed callback routine.

  @Description
    This routine is a ADC1 POT_Speed callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetPOT_SpeedInterruptHandler(&ADC1_POT_Speed_CallBack);
    </code>
*/
void ADC1_POT_Speed_CallBack(uint16_t adcVal);

/**
  @Summary
    Assigns a function pointer with a ADC1 POT_Speed callback address.

  @Description
    This routine assigns a function pointer with a ADC1 POT_Speed callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetPOT_SpeedInterruptHandler(&ADC1_POT_Speed_CallBack);
    </code>
*/
void ADC1_SetPOT_SpeedInterruptHandler(void* handler);

/**
  @Summary
    ADC1 channel_AN24 callback routine.

  @Description
    This routine is a ADC1 channel_AN24 callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_Setchannel_AN24InterruptHandler(&ADC1_channel_AN24_CallBack);
    </code>
*/
void ADC1_channel_AN24_CallBack(uint16_t adcVal);

/**
  @Summary
    Assigns a function pointer with a ADC1 channel_AN24 callback address.

  @Description
    This routine assigns a function pointer with a ADC1 channel_AN24 callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_Setchannel_AN24InterruptHandler(&ADC1_channel_AN24_CallBack);
    </code>
*/
void ADC1_Setchannel_AN24InterruptHandler(void* handler);

/**
  @Summary
    ADC1 channel_AN25 callback routine.

  @Description
    This routine is a ADC1 channel_AN25 callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_Setchannel_AN25InterruptHandler(&ADC1_channel_AN25_CallBack);
    </code>
*/
void ADC1_channel_AN25_CallBack(uint16_t adcVal);

/**
  @Summary
    Assigns a function pointer with a ADC1 channel_AN25 callback address.

  @Description
    This routine assigns a function pointer with a ADC1 channel_AN25 callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_Setchannel_AN25InterruptHandler(&ADC1_channel_AN25_CallBack);
    </code>
*/
void ADC1_Setchannel_AN25InterruptHandler(void* handler);




/**
  Section: Interface Routines: Dedicated Core
*/
/**
  @Summary
    Enables power for Core 0 

  @Description
    This routine is used to set the analog and digital power for ADC1 Core 0.
 
  @Preconditions
    None.

  @Param
    None

  @Returns
    None.

  @Example
    Refer to ADC1_Initialize() for an example
*/
void ADC1_Core0PowerEnable(void);

/**
  @Summary
    Enables power for Core 1 

  @Description
    This routine is used to set the analog and digital power for ADC1 Core 1.
 
  @Preconditions
    None.

  @Param
    None

  @Returns
    None.

  @Example
    Refer to ADC1_Initialize() for an example
*/
void ADC1_Core1PowerEnable(void);


/**
  @Summary
    Enables power for ADC1 shared Core

  @Description
    This routine is used to set the analog and digital power for ADC1 shared Core.
 
  @Preconditions
    None.

  @Param
    None

  @Returns
    None.

  @Example
    Refer to ADC1_Initialize() for an example
*/
void ADC1_SharedCorePowerEnable(void);



