eddy103-hub/bldc_hall_oledC/dsPIC33CK_BLDC_Motor/dsPIC33CK_BLDC_Motor.X/mcc_generated_files/adc1.h
inline static bool __attribute__((deprecated("\nThis will be removed in future MCC releases."))) ADC1_IsSharedChannelAN15ConversionComplete(void)
{   
    return ADSTATLbits.AN15RDY;
}
/**
  @Summary
    Returns the ADC1 conversion value for the shared core channel AN17

  @Description
    This routine is used to get the analog to digital converted value for channel AN17. This
    routine gets converted values from the shared core channel AN17.
 
  @Preconditions
    The shared core must be enabled and calibrated before calling this routine 
    using ADC1_SharedCorePowerEnable() and ADC1_SharedCoreCalibration() 
    respectively. This routine returns the conversion value only after the 
    conversion is complete. Completion status conversion can be checked using 
    ADC1_IsSharedChannelAN17ConversionComplete() routine.
   
  @Returns
    Returns the buffer containing the conversion value.

  @Param
    Buffer address
  
  @Example
    Refer to ADC1_Initialize(); for an example
 */
inline static uint16_t __attribute__((deprecated("\nThis will be removed in future MCC releases."))) ADC1_SharedChannelAN17ConversionResultGet(void) 
{
    return ADCBUF17;
}
/**
  @Summary
    Returns the conversion status of shared channel AN17 selected for conversion

  @Description
    This routine is used to return the conversion status of the shared channel AN17 
    selected for conversion.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Returns
    The value of the Channel AN17 Conversion register

  @Param
    None
  
  @Example
    Refer to ADC1_Initialize(); for an example
 
*/

inline static bool __attribute__((deprecated("\nThis will be removed in future MCC releases."))) ADC1_IsSharedChannelAN17ConversionComplete(void)
{   
    return ADSTATHbits.AN17RDY;
}
/**
  @Summary
    Returns the ADC1 conversion value for the shared core channel AN22

  @Description
    This routine is used to get the analog to digital converted value for channel AN22. This
    routine gets converted values from the shared core channel AN22.
 
  @Preconditions
    The shared core must be enabled and calibrated before calling this routine 
    using ADC1_SharedCorePowerEnable() and ADC1_SharedCoreCalibration() 
    respectively. This routine returns the conversion value only after the 
    conversion is complete. Completion status conversion can be checked using 
    ADC1_IsSharedChannelAN22ConversionComplete() routine.
   
  @Returns
    Returns the buffer containing the conversion value.

  @Param
    Buffer address
  
  @Example
    Refer to ADC1_Initialize(); for an example
 */
inline static uint16_t __attribute__((deprecated("\nThis will be removed in future MCC releases."))) ADC1_SharedChannelAN22ConversionResultGet(void) 
{
    return ADCBUF22;
}
/**
  @Summary
    Returns the conversion status of shared channel AN22 selected for conversion

  @Description
    This routine is used to return the conversion status of the shared channel AN22 
    selected for conversion.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Returns
    The value of the Channel AN22 Conversion register

  @Param
    None
  
  @Example
    Refer to ADC1_Initialize(); for an example
 
*/

inline static bool __attribute__((deprecated("\nThis will be removed in future MCC releases."))) ADC1_IsSharedChannelAN22ConversionComplete(void)
{   
    return ADSTATHbits.AN22RDY;
}
/**
  @Summary
    Returns the ADC1 conversion value for the shared core channel AN23

  @Description
    This routine is used to get the analog to digital converted value for channel AN23. This
    routine gets converted values from the shared core channel AN23.
 
  @Preconditions
    The shared core must be enabled and calibrated before calling this routine 
    using ADC1_SharedCorePowerEnable() and ADC1_SharedCoreCalibration() 
    respectively. This routine returns the conversion value only after the 
    conversion is complete. Completion status conversion can be checked using 
    ADC1_IsSharedChannelAN23ConversionComplete() routine.
   
  @Returns
    Returns the buffer containing the conversion value.

  @Param
    Buffer address
  
  @Example
    Refer to ADC1_Initialize(); for an example
 */
inline static uint16_t __attribute__((deprecated("\nThis will be removed in future MCC releases."))) ADC1_SharedChannelAN23ConversionResultGet(void) 
{
    return ADCBUF23;
}
/**
  @Summary
    Returns the conversion status of shared channel AN23 selected for conversion

  @Description
    This routine is used to return the conversion status of the shared channel AN23 
    selected for conversion.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Returns
    The value of the Channel AN23 Conversion register

  @Param
    None
  
  @Example
    Refer to ADC1_Initialize(); for an example
 
*/

inline static bool __attribute__((deprecated("\nThis will be removed in future MCC releases."))) ADC1_IsSharedChannelAN23ConversionComplete(void)
{   
    return ADSTATHbits.AN23RDY;
}

#ifdef __cplusplus  // Provide C++ Compatibility

    }

#endif

#endif //_ADC1_H
    
/**
 End of File
*/
